<a href="https://colab.research.google.com/github/hyunicecream/Inflearn/blob/main/1_2_%ED%8C%8C%EC%9D%BC%EC%97%90%EC%84%9C_%EB%8D%B0%EC%9D%B4%ED%84%B0_%EB%B6%88%EB%9F%AC%EC%98%A4%EA%B8%B0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
%cd '/content/drive/MyDrive/Private_room/Inflearn/Pandas Data Analysis/data'

/content/drive/MyDrive/Private_room/Inflearn/Pandas Data Analysis

In [ ]:
# 쉼표로 구분된 파일 
df = pd.read_csv('data/friend_list.csv')

In [ ]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45     managr
5  Chris   25     intern

In [ ]:
df.head() # 1 ~5개까지의 값

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45     managr

In [ ]:
df.tail()  # 뒤에서 부터

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45     managr
5  Chris   25     intern

In [ ]:
# 쉼표로 구분된 파일 
df = pd.read_csv('data/friend_list.txt')
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [ ]:
# tab으로 구분된 파일
df = pd.read_csv('data/friend_list_tab.txt')
df

         name\tage\tjob
0     John\t20\tstudent
1  Jenny\t30\tdeveloper
2     Nate\t30\tteacher
3    Julia\t40\tdentist
4    Brian\t45\tmanager
5     Chris\t25\tintern

In [ ]:
# delimiter로 쉼표가 아닌 탭으로 구분되어 있다고 해야한다. 
df = pd.read_csv('data/friend_list_tab.txt', delimiter= '\t')
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [ ]:
# 해더가 없을경우
df = pd.read_csv('data/friend_list_no_head.csv')
df

    John  20    student
0  Jenny  30  developer
1   Nate  30    teacher
2  Julia  40    dentist
3  Brian  45    manager
4  Chris  25     intern

In [ ]:
# header가 없을경우 인덱스 번호가 들어간다. 
df = pd.read_csv('data/friend_list_no_head.csv', header=None)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager
5  Chris  25     intern

In [ ]:
# columns의 이름 바꾸기
df.columns = ['Name','Age','Job']
df

    Name  Age        Job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [ ]:
# 위의 헤더가 없는 경우 two step을 one step으로 끝내기
# 바로 names를 주고 컬럼 이름을 부여하면 된다. 
df = pd.read_csv('data/friend_list_no_head.csv',
                 header=None,
                 names = ['name', 'age','job'])
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern